# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables
**IMPORTANT:** The following exercise depends on first having successing completed Exercise 1: Step 4. 

Start by running the code in the cell below to connect to the database. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed steps 1 through 4, then skip to the second cell.

In [1]:
#!PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila
#!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-schema.sql
#!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-data.sql

In [1]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

postgresql://student:student@127.0.0.1:5432/pagila

'Connected: student@pagila'

### Introducing SQL to SQL ETL
When writing SQL to SQL ETL, you first create a table then use the INSERT and SELECT statements together to populate the table. Here's a simple example.

First, you create a table called test_table

In [2]:
%%sql
CREATE TABLE test_table
(
  date timestamp,
  revenue  decimal(5,2)
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

Then you use the INSERT and SELECT statements to populate the table. In this case, the SELECT statement extracts data from the `payment` table and INSERTs it INTO the `test_table`.

In [3]:
%%sql
INSERT INTO test_table (date, revenue)
SELECT payment_date AS date,
       amount AS revenue
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

Then you can use a SELECT statement to take a look at your new table.

In [4]:
%sql SELECT * FROM test_table LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(datetime.datetime(2007, 1, 24, 21, 40, 19, 996577), Decimal('1.99')),
 (datetime.datetime(2007, 1, 25, 15, 16, 50, 996577), Decimal('0.99')),
 (datetime.datetime(2007, 1, 28, 21, 44, 14, 996577), Decimal('6.99')),
 (datetime.datetime(2007, 1, 29, 0, 58, 2, 996577), Decimal('0.99')),
 (datetime.datetime(2007, 1, 29, 8, 10, 6, 996577), Decimal('4.99'))]

If you need to delete the table and start over, use the DROP TABLE command, like below.

In [5]:
%sql DROP TABLE test_table

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

Great! Now you'll do the same thing below to create the dimension and fact tables for the Star Schema using the data in the 3NF database.

## ETL from 3NF to Star Schema

### 3NF - Entity Relationship Diagram

<img src="./pagila-3nf.png" width="50%"/>

### Star Schema - Entity Relationship Diagram

<img src="pagila-star.png" width="50%"/>

In this section, you'll populate the tables in the Star schema. You'll `extract` data from the normalized database, `transform` it, and `load` it into the new tables. 

To serve as an example, below is the query that populates the `dimDate` table with data from the `payment` table.
* NOTE 1: The EXTRACT function extracts date parts from the payment_date variable.
* NOTE 2: If you get an error that says that the `dimDate` table doesn't exist, then go back to Exercise 1: Step 4 and recreate the tables.

In [31]:
%%sql 
DELETE FROM dimdate;

 * postgresql://student:***@127.0.0.1:5432/pagila
40 rows affected.

[]

In [27]:
%%sql 
select * FROM payment limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2007, 1, 24, 21, 40, 19, 996577)),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2007, 1, 25, 15, 16, 50, 996577)),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2007, 1, 28, 21, 44, 14, 996577)),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2007, 1, 29, 0, 58, 2, 996577)),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2007, 1, 29, 8, 10, 6, 996577)),
 (16055, 269, 2, 1099, Decimal('2.99'), datetime.datetime(2007, 1, 31, 12, 23, 14, 996577)),
 (16056, 270, 1, 193, Decimal('1.99'), datetime.datetime(2007, 1, 26, 5, 10, 14, 996577)),
 (16057, 270, 1, 1040, Decimal('4.99'), datetime.datetime(2007, 1, 31, 4, 3, 42, 996577)),
 (16058, 271, 1, 1096, Decimal('8.99'), datetime.datetime(2007, 1, 31, 11, 59, 15, 996577)),
 (16059, 272, 1, 33, Decimal('0.99'), datetime.datetime(2007, 1, 25, 2, 47, 17, 996577))]

In [30]:
%%sql 
select * FROM dimdate limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[(20070321, datetime.date(2007, 3, 21), 2007, 1, 3, 21, 12, False),
 (20070128, datetime.date(2007, 1, 28), 2007, 1, 1, 28, 4, False),
 (20070428, datetime.date(2007, 4, 28), 2007, 2, 4, 28, 17, False),
 (20070216, datetime.date(2007, 2, 16), 2007, 1, 2, 16, 7, False),
 (20070406, datetime.date(2007, 4, 6), 2007, 2, 4, 6, 14, False),
 (20070221, datetime.date(2007, 2, 21), 2007, 1, 2, 21, 8, False),
 (20070323, datetime.date(2007, 3, 23), 2007, 1, 3, 23, 12, False),
 (20070427, datetime.date(2007, 4, 27), 2007, 2, 4, 27, 17, False),
 (20070126, datetime.date(2007, 1, 26), 2007, 1, 1, 26, 4, False),
 (20070301, datetime.date(2007, 3, 1), 2007, 1, 3, 1, 9, False)]

In [34]:
%%sql 
select * FROM dimdate;

 * postgresql://student:***@127.0.0.1:5432/pagila
40 rows affected.

[(20070321, datetime.date(2007, 3, 21), 2007, 1, 3, 21, 12, False),
 (20070128, datetime.date(2007, 1, 28), 2007, 1, 1, 28, 4, False),
 (20070428, datetime.date(2007, 4, 28), 2007, 2, 4, 28, 17, False),
 (20070216, datetime.date(2007, 2, 16), 2007, 1, 2, 16, 7, False),
 (20070406, datetime.date(2007, 4, 6), 2007, 2, 4, 6, 14, False),
 (20070221, datetime.date(2007, 2, 21), 2007, 1, 2, 21, 8, False),
 (20070323, datetime.date(2007, 3, 23), 2007, 1, 3, 23, 12, False),
 (20070427, datetime.date(2007, 4, 27), 2007, 2, 4, 27, 17, False),
 (20070126, datetime.date(2007, 1, 26), 2007, 1, 1, 26, 4, False),
 (20070301, datetime.date(2007, 3, 1), 2007, 1, 3, 1, 9, False),
 (20070412, datetime.date(2007, 4, 12), 2007, 2, 4, 12, 15, False),
 (20070409, datetime.date(2007, 4, 9), 2007, 2, 4, 9, 15, True),
 (20070214, datetime.date(2007, 2, 14), 2007, 1, 2, 14, 7, False),
 (20070408, datetime.date(2007, 4, 8), 2007, 2, 4, 8, 14, False),
 (20070320, datetime.date(2007, 3, 20), 2007, 1, 3, 20, 12, False),
 (20070430, datetime.date(2007, 4, 30), 2007, 2, 4, 30, 18, True),
 (20070220, datetime.date(2007, 2, 20), 2007, 1, 2, 20, 8, False),
 (20070514, datetime.date(2007, 5, 14), 2007, 2, 5, 14, 20, True),
 (20070322, datetime.date(2007, 3, 22), 2007, 1, 3, 22, 12, False),
 (20070410, datetime.date(2007, 4, 10), 2007, 2, 4, 10, 15, False),
 (20070429, datetime.date(2007, 4, 29), 2007, 2, 4, 29, 17, False),
 (20070405, datetime.date(2007, 4, 5), 2007, 2, 4, 5, 14, False),
 (20070125, datetime.date(2007, 1, 25), 2007, 1, 1, 25, 4, False),
 (20070411, datetime.date(2007, 4, 11), 2007, 2, 4, 11, 15, False),
 (20070219, datetime.date(2007, 2, 19), 2007, 1, 2, 19, 8, True),
 (20070318, datetime.date(2007, 3, 18), 2007, 1, 3, 18, 11, False),
 (20070407, datetime.date(2007, 4, 7), 2007, 2, 4, 7, 14, False),
 (20070127, datetime.date(2007, 1, 27), 2007, 1, 1, 27, 4, False),
 (20070426, datetime.date(2007, 4, 26), 2007, 2, 4, 26, 17, False),
 (20070124, datetime.date(2007, 1, 24), 2007, 1, 1, 24, 4, False),
 (20070316, datetime.date(2007, 3, 16), 2007, 1, 3, 16, 11, False),
 (20070302, datetime.date(2007, 3, 2), 2007, 1, 3, 2, 9, False),
 (20070131, datetime.date(2007, 1, 31), 2007, 1, 1, 31, 5, False),
 (20070317, datetime.date(2007, 3, 17), 2007, 1, 3, 17, 11, False),
 (20070217, datetime.date(2007, 2, 17), 2007, 1, 2, 17, 7, False),
 (20070215, datetime.date(2007, 2, 15), 2007, 1, 2, 15, 7, False),
 (20070129, datetime.date(2007, 1, 29), 2007, 1, 1, 29, 5, True),
 (20070130, datetime.date(2007, 1, 30), 2007, 1, 1, 30, 5, False),
 (20070218, datetime.date(2007, 2, 18), 2007, 1, 2, 18, 7, False),
 (20070319, datetime.date(2007, 3, 19), 2007, 1, 3, 19, 12, True)]

In [32]:
%%sql
INSERT INTO dimdate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
    date(payment.payment_date) as date,
    EXTRACT(YEAR FROM payment.payment_date) as year,
    EXTRACT(QUARTER FROM payment.payment_date) as quarter,
    EXTRACT(MONTH FROM payment.payment_date) as month,
    EXTRACT(DAY FROM payment.payment_date) as day,
    EXTRACT(WEEK FROM payment.payment_date) as week,
    CASE WHEN date_part('dow', payment.payment_date) in (1, 7) THEN true ELSE false END  as is_weekend
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
40 rows affected.

[]

In [23]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
40 rows affected.

[]

In [43]:
%%sql
INSERT INTO dimCustomer (customer_key, customer_id, first_name, last_name, email, address, 
                         address2, district, city, country, postal_code, phone, active, 
                         create_date, start_date, end_date)
SELECT c.customer_id as customer_key,
    c.customer_id,    
    c.first_name,
    c.last_name,
    c.email,
    a.address,
    a.address2,
    a.district,
    city.city,
    country.country,
    a.postal_code,
    a.phone,
    c.active,
    c.create_date,
    now() as start_date,
    now() as end_date
FROM customer c
JOIN address a ON (c.address_id = a.address_id)
JOIN city on (city.city_id = a.city_id)
JOIN country on (city.country_id=country.country_id);

 * postgresql://student:***@127.0.0.1:5432/pagila

IntegrityError: (psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "dimcustomer_pkey"
DETAIL:  Key (customer_key)=(1) already exists.

[SQL: INSERT INTO dimCustomer (customer_key, customer_id, first_name, last_name, email, address,
                         address2, district, city, country, postal_code, phone, active,
                         create_date, start_date, end_date)
SELECT c.customer_id as customer_key,
    c.customer_id,
    c.first_name,
    c.last_name,
    c.email,
    a.address,
    a.address2,
    a.district,
    city.city,
    country.country,
    a.postal_code,
    a.phone,
    c.active,
    c.create_date,
    now() as start_date,
    now() as end_date
FROM customer c
JOIN address a ON (c.address_id = a.address_id)
JOIN city on (city.city_id = a.city_id)
JOIN country on (city.country_id=country.country_id);]
(Background on this error at: http://sqlalche.me/e/gkpj)

In [21]:
%%sql
INSERT INTO dimCustomer (customer_key, customer_id, first_name, last_name, email, address, 
                         address2, district, city, country, postal_code, phone, active, 
                         create_date, start_date, end_date)
SELECT  c.customer_id  AS customer_key,
        c.customer_id,
        c.first_name,
        c.last_name,
        c.email,
        a.address,
        a.address2,
        a.district,
        ci.city,
        co.country,
        a.postal_code,
        a.phone,
        c.active,
        now()         AS create_date,
        now()         AS start_date,
        now()         AS end_date
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id);

 * postgresql://student:***@127.0.0.1:5433/pagila
599 rows affected.

[]

User **left join** here because original_language may have *NONE*. In case original_language is None, return value will be in film.

![](https://3.bp.blogspot.com/-iW-J8b5sbOA/V5W_xfsXbRI/AAAAAAAAMSw/692mWk9Od7YfD29r6PD9wkhx7kKbJtzqACLcB/s1600/66zgg.png)

In [47]:
%%sql INSERT INTO dimMovie (movie_key, film_id, title, description, release_year, language, original_language, rental_duration,
                     length, rating, special_features)
SELECT film.film_id as movie_key,
    film.film_id,
    film.title,
    film.description,
    film.release_year,
    l.name as language,
    ol.name as original_language,
    film.rental_duration,
    film.length,
    film.rating,
    film.special_features
FROM film
JOIN language as l ON (film.language_id = l.language_id)
left JOIN language as ol ON (film.original_language_id = ol.language_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
1000 rows affected.

[]

In [58]:
%%sql
select *
FROM film
inner JOIN language as l ON (l.language_id = film.language_id)
inner join language as ol ON ( ol.language_id = film.original_language_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
0 rows affected.

[]

In [49]:
%%sql
SELECT 
    f.film_id      AS movie_key,
    f.film_id,
    f.title,
    f.description,
    f.release_year,
    l.name         AS language,
    f.rental_duration,
    f.length,
    f.rating,
    f.special_features
FROM film f
JOIN language l              ON (f.language_id=l.language_id) limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[(1, 1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 'English             ', 6, 86, 'PG', ['Deleted Scenes', 'Behind the Scenes']),
 (2, 2, 'ACE GOLDFINGER', 'A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', 2006, 'English             ', 3, 48, 'G', ['Trailers', 'Deleted Scenes']),
 (3, 3, 'ADAPTATION HOLES', 'A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory', 2006, 'English             ', 7, 50, 'NC-17', ['Trailers', 'Deleted Scenes']),
 (4, 4, 'AFFAIR PREJUDICE', 'A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank', 2006, 'English             ', 5, 117, 'G', ['Commentaries', 'Behind the Scenes']),
 (5, 5, 'AFRICAN EGG', 'A Fast-Paced Documentary of a Pastry Chef And a Dentist who must Pursue a Forensic Psychologist in The Gulf of Mexico', 2006, 'English             ', 6, 130, 'G', ['Deleted Scenes']),
 (6, 6, 'AGENT TRUMAN', 'A Intrepid Panorama of a Robot And a Boy who must Escape a Sumo Wrestler in Ancient China', 2006, 'English             ', 3, 169, 'PG', ['Deleted Scenes']),
 (7, 7, 'AIRPLANE SIERRA', 'A Touching Saga of a Hunter And a Butler who must Discover a Butler in A Jet Boat', 2006, 'English             ', 6, 62, 'PG-13', ['Trailers', 'Deleted Scenes']),
 (8, 8, 'AIRPORT POLLOCK', 'A Epic Tale of a Moose And a Girl who must Confront a Monkey in Ancient India', 2006, 'English             ', 6, 54, 'R', ['Trailers']),
 (9, 9, 'ALABAMA DEVIL', 'A Thoughtful Panorama of a Database Administrator And a Mad Scientist who must Outgun a Mad Scientist in A Jet Boat', 2006, 'English             ', 3, 114, 'PG-13', ['Trailers', 'Deleted Scenes']),
 (10, 10, 'ALADDIN CALENDAR', 'A Action-Packed Tale of a Man And a Lumberjack who must Reach a Feminist in Ancient China', 2006, 'English             ', 6, 63, 'NC-17', ['Trailers', 'Deleted Scenes'])]

In [22]:
%%sql
INSERT INTO dimMovie (movie_key, film_id, title, description, release_year, language, original_language, rental_duration, 
                      length, rating, special_features)
SELECT 
    f.film_id      AS movie_key,
    f.film_id,
    f.title,
    f.description,
    f.release_year,
    l.name         AS language,
    orig_lang.name AS original_language,
    f.rental_duration,
    f.length,
    f.rating,
    f.special_features
FROM film f
JOIN language l              ON (f.language_id=l.language_id)
LEFT JOIN language orig_lang ON (f.original_language_id = orig_lang.language_id);

 * postgresql://student:***@127.0.0.1:5433/pagila
1000 rows affected.

[]

In [27]:
%%sql
INSERT INTO dimStore(store_key, store_id, address, address2, district, city, country, postal_code, manager_first_name, manager_last_name, start_date, end_date)
SELECT  s.store_id     AS store_key,
        s.store_id,
        a.address,
        a.address2,
        a.district,
        ci.city,
        co.country,
        a.postal_code,
        st.first_name  AS manager_first_name,
        st.last_name   AS manager_last_name,
        now()          AS first_date,
        now()          AS last_date
FROM store s
JOIN staff st    ON st.store_id = s.store_id
JOIN address a   ON a.address_id = s.address_id
JOIN city ci     ON ci.city_id = a.city_id
JOIN country co  ON ci.country_id = co.country_id

 * postgresql://student:***@127.0.0.1:5433/pagila
2 rows affected.

[]

In [28]:
%%sql
INSERT INTO factSales(date_key, customer_key, movie_key, store_key, sales_amount)
SELECT 
    DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
    p.customer_id                                                AS customer_key,
    i.film_id                                                    AS movie_key,
    i.store_id                                                   AS store_key,
    p.amount                                                     AS sales_amount
FROM payment p
JOIN rental r     ON r.rental_id = p.rental_id
JOIN inventory i  ON i.inventory_id = r.inventory_id

 * postgresql://student:***@127.0.0.1:5433/pagila
16049 rows affected.

[]

In [18]:
%%sql
#DROP TABLE factSales;
#DROP TABLE dimStore;
#DROP TABLE dimMovie;
#DROP TABLE dimCustomer;
#DROP TABLE dimDate;

 * postgresql://student:***@127.0.0.1:5433/pagila
Done.
Done.
Done.
Done.
Done.

[]